#include <stdio.h>

int main() {
    float a, b, c;

    printf("Введіть довжину першої сторони: ");
    scanf("%f", &a);

    printf("Введіть довжину другої сторони: ");
    scanf("%f", &b);

    printf("Введіть довжину третьої сторони: ");
    scanf("%f", &c);

    // Перевірка на можливість утворення трикутника
    if (a + b > c && a + c > b && b + c > a) {
        if (a == b && b == c) {
            printf("Трикутник є рівностороннім.\n");
        } else if (a == b || b == c || a == c) {
            printf("Трикутник є рівнобедреним.\n");
        } else {
            printf("Трикутник є різностороннім.\n");
        }
    } else {
        printf("Трикутника зі заданими сторонами не існує.\n");
    }

    return 0;
}
